#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.github_secrets.data.github_repository.this: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.module.user_ecoutu.aws_iam_user.this: Refreshing state... [id=ecoutu]
module.iam.aws_iam_policy.enforce_mfa[0]: Refreshing state... [id=arn:aws:iam::385569635049:policy/ecoutu-enforce-mfa]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07a4f4c7aecaf89b0]
module.iam.aws_iam_policy.console_self_service: Refreshing state... [id=arn:aws:iam::385569635049:policy/ecoutu-console-self-service]
module.minikube.data.aws_ami.selected[0]: Reading...
module.github_actions_role.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::385569635049:oidc-provider/token.actions.githubusercontent.com]
module.terraform_backend[0].aws_dynamodb_table.terraform_state_lock: Refreshing state... [id=ecoutu-terraform-stack-state-lock]
module.terraform_backend[0].aws_s3_bucket.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.github_secrets.data.github_repository.this: Read complete after 0s [id=terraform-stack]
module.iam.aws_iam_account_alias.alias[0]: Refreshing state... [id=ecoutu]
module.github_secrets.github_actions_variable.aws_region: Refreshing state... [id=terraform-stack:AWS_REGION]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.github_secrets.github_actions_secret.additional["TF_VAR_github_token"]: Refreshing state... [id=terraform-stack:TF_VAR_github_token]
module.github_secrets.github_actions_variable.additional["TF_VAR_github_branches"]: Refreshing state... [id=terraform-stack:TF_VAR_github_branches]
module.github_secrets.github_actions_variable.additional["TF_VAR_aws_region"]: Refreshing state... [id=terraform-stack:TF_VAR_aws_region]
module.github_secrets.github_actions_variable.additional["TF_VAR_enable_nat_gateway"]: Refreshing state... [id=terraform-stack:TF_VAR_enable_nat_gateway]
module.github_secrets.github_actions_variable.additional["TF_VAR_github_repo"]: Refreshing state... [id=terraform-stack:TF_VAR_github_repo]
module.github_secrets.github_actions_variable.additional["TF_VAR_terraform_state_bucket"]: Refreshing state... [id=terraform-stack:TF_VAR_terraform_state_bucket]
module.minikube.data.aws_ami.selected[0]: Read complete after 0s [id=ami-00b13f11600160c10]
module.github_secrets.github_actions_variable.additional["TF_VAR_enable_remote_state"]: Refreshing state... [id=terraform-stack:TF_VAR_enable_remote_state]
module.github_secrets.github_actions_variable.additional["TF_VAR_project_name"]: Refreshing state... [id=terraform-stack:TF_VAR_project_name]
module.github_secrets.github_actions_variable.additional["TF_VAR_vpc_cidr"]: Refreshing state... [id=terraform-stack:TF_VAR_vpc_cidr]
module.github_secrets.github_actions_variable.additional["TF_VAR_az_count"]: Refreshing state... [id=terraform-stack:TF_VAR_az_count]
module.github_secrets.github_actions_variable.additional["TF_VAR_environment"]: Refreshing state... [id=terraform-stack:TF_VAR_environment]
module.github_secrets.github_actions_variable.additional["TF_VAR_github_org"]: Refreshing state... [id=terraform-stack:TF_VAR_github_org]
module.iam.module.user_ecoutu.aws_iam_access_key.this[0]: Refreshing state... [id=AKIAVTRN5XLUVYADSFUS]
module.iam.module.user_ecoutu.aws_iam_user_login_profile.this[0]: Refreshing state... [id=ecoutu]
module.github_actions_role.data.aws_iam_policy_document.github_actions_assume_role: Reading...
module.github_actions_role.data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=795156191]
module.terraform_backend[0].aws_s3_bucket_policy.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_lifecycle_configuration.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_server_side_encryption_configuration.terraform_state[0]: Refreshing state... [id=ecoutu-terraform-stack-state]
module.iam.aws_iam_user_policy_attachment.console_self_service: Refreshing state... [id=ecoutu-20251114193444373700000001]
module.iam.aws_iam_user_policy_attachment.enforce_mfa[0]: Refreshing state... [id=ecoutu-20251114201151476300000001]
module.github_actions_role.aws_iam_role.github_actions: Refreshing state... [id=GitHubActionsTerraformRole]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-05873b0b86f0b3d90]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04acc2cf83bb81383]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0588bec4faa528d07]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-047ef2a787a53ff13]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-033ac756e4f409217]
module.iam.module.admin_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.iam.module.admin_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3606377518]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0c6567cd904f03b12]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-041bb33ee0f5cdddc]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-02b1cef271245381b]
module.iam.module.admin_role.aws_iam_role.this: Refreshing state... [id=dev-admin-role]
module.github_actions_role.aws_iam_role_policy.inline["TerraformDeployment"]: Refreshing state... [id=GitHubActionsTerraformRole:TerraformDeployment]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d842f397f187b1db]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f0ab5a227aafca55]
module.github_secrets.github_actions_secret.aws_role_to_assume: Refreshing state... [id=terraform-stack:AWS_ROLE_TO_ASSUME]
module.iam.module.admin_role.aws_iam_role_policy_attachment.managed_policies["arn:aws:iam::aws:policy/AdministratorAccess"]: Refreshing state... [id=dev-admin-role-20251114193453048900000002]
module.iam.module.admin_role.aws_iam_instance_profile.this[0]: Refreshing state... [id=dev-admin-role]
module.iam.aws_iam_policy.user_assume_admin: Refreshing state... [id=arn:aws:iam::385569635049:policy/ecoutu-assume-admin-role]
module.iam.aws_iam_user_policy_attachment.user_assume_admin: Refreshing state... [id=ecoutu-20251114193453575900000003]
module.vpc.aws_nat_gateway.main[1]: Refreshing state... [id=nat-0ca431a6bacf6f444]
module.vpc.aws_nat_gateway.main[0]: Refreshing state... [id=nat-063527dfa69e5869f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04f9070ce070d18a2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06bb8e9e38465de33]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06b3672797ee528ef]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-041bf8c9c59cc7868]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.minikube.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-00b13f11600160c10"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-04acc2cf83bb81383"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-minikube"
          + "Project"     = "linklayer"
          + "Purpose"     = "Minikube Development"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-minikube"
          + "Project"     = "linklayer"
          + "Purpose"     = "Minikube Development"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp3"
        }
    }

  # module.minikube.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for dev-minikube"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Kubernetes API Server"
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "dev-minikube-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-minikube-sg"
          + "Project"     = "linklayer"
          + "Purpose"     = "Minikube Development"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-minikube-sg"
          + "Project"     = "linklayer"
          + "Purpose"     = "Minikube Development"
        }
      + vpc_id                 = "vpc-07a4f4c7aecaf89b0"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ecoutu, Action: `pull_request`*